app/views/articles/show.html.erb

            <h4 class="mb-4"><%= article.title %></h4>
            <p class="card-author-up author-border"><%= User.find(article.user_id).name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]