app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @article = Article.new
    @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Orgasm"], ["created_at", "2019-11-26 16:28:42.527444"], ["updated_at", "2019-11-26 16:28:42.527444"]]
INSERT INTO "articles" ("title", "category_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sadssdads"], ["category_id", 1], ["content", "aweeawewaae"], ["user_id", 1], ["created_at", "2019-11-26 16:52:03.660759"], ["updated_at", "2019-11-26 16:52:03.660759"]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user

    @category = @article.category

    if @article.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_category
    @category = Category.find(params[:category_id])